<?php
return array(
    'smsbao' =>
        array(
            "0" => "短信发送成功",
            "-1" => "参数不全",
            "-2" => "服务器空间不支持,请确认支持curl或者fsocket，联系您的空间商解决或者更换空间！",
            "30" => "密码错误",
            "40" => "账号不存在",
            "41" => "余额不足",
            "42" => "帐户已过期",
            "43" => "IP地址限制",
            "50" => "内容含有敏感词",
            "51" => "手机号码不正确",
        ),
    'tuling' =>
        array(
            "100000" => "文字请求成功",
            "200000" => "图片请求成功",
            "302000" => "新闻请求成功",
            "40001" => "参数key错误",
            "40002" => "请求内容info为空",
            "40004" => "当天请求次数已使用完",
            "40007" => "数据格式异常/请按规定的要求进行加密",
        ),
    'baidu_map' =>
        array(
            "0" => "正常",
            "1" => "服务器内部错误",
            "2" => "请求参数非法",
            "3" => "权限校验失败",
            "4" => "配额校验失败",
            "5" => "ak不存在或者非法",
            "101" => "服务禁用",
            "102" => "不通过白名单或者安全码不对",
            "2xx" => "无权限",
            "3xx" => "配额错误",
        ),

);